# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

alphabet = 'abcdefghijklmnopqrstuvwxyz'
print('Ваша буква: ' + alphabet[int(input('Введите номер буквы (от 1 до 26): '))-1])
